Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxMtu_reg.h
/** \brief 3B8, Read Data and Bit Flip Register 44 */
#define MTU_MC3_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B8u)

/** \brief 3BA, Read Data and Bit Flip Register 45 */
#define MTU_MC3_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613BAu)

/** \brief 3BC, Read Data and Bit Flip Register 46 */
#define MTU_MC3_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613BCu)

/** \brief 3BE, Read Data and Bit Flip Register 47 */
#define MTU_MC3_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613BEu)

/** \brief 3C0, Read Data and Bit Flip Register 48 */
#define MTU_MC3_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C0u)

/** \brief 3C2, Read Data and Bit Flip Register 49 */
#define MTU_MC3_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C2u)

/** \brief 3C4, Read Data and Bit Flip Register 50 */
#define MTU_MC3_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C4u)

/** \brief 3C6, Read Data and Bit Flip Register 51 */
#define MTU_MC3_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C6u)

/** \brief 3C8, Read Data and Bit Flip Register 52 */
#define MTU_MC3_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613C8u)

/** \brief 3CA, Read Data and Bit Flip Register 53 */
#define MTU_MC3_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613CAu)

/** \brief 3CC, Read Data and Bit Flip Register 54 */
#define MTU_MC3_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613CCu)

/** \brief 3CE, Read Data and Bit Flip Register 55 */
#define MTU_MC3_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613CEu)

/** \brief 3D0, Read Data and Bit Flip Register 56 */
#define MTU_MC3_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D0u)

/** \brief 3D2, Read Data and Bit Flip Register 57 */
#define MTU_MC3_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D2u)

/** \brief 3D4, Read Data and Bit Flip Register 58 */
#define MTU_MC3_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D4u)

/** \brief 3D6, Read Data and Bit Flip Register 59 */
#define MTU_MC3_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D6u)

/** \brief 3D8, Read Data and Bit Flip Register 60 */
#define MTU_MC3_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613D8u)

/** \brief 3DA, Read Data and Bit Flip Register 61 */
#define MTU_MC3_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613DAu)

/** \brief 3DC, Read Data and Bit Flip Register 62 */
#define MTU_MC3_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613DCu)

/** \brief 3DE, Read Data and Bit Flip Register 63 */
#define MTU_MC3_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613DEu)

/** \brief 3E0, Read Data and Bit Flip Register 64 */
#define MTU_MC3_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613E0u)

/** \brief 3E2, Read Data and Bit Flip Register 65 */
#define MTU_MC3_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613E2u)

/** \brief 3E4, Read Data and Bit Flip Register 66 */
#define MTU_MC3_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613E4u)

/** \brief 3EE, Alarm Sources Configuration Register */
#define MTU_MC3_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00613EEu)

/** \brief 3F0, SSH Safety Faults Status Register  */
#define MTU_MC3_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00613F0u)

/** \brief 3F2, Error Information Register 0 */
#define MTU_MC3_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613F2u)

/** \brief 3F4, Error Information Register 1 */
#define MTU_MC3_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613F4u)

/** \brief 3F6, Error Information Register 2 */
#define MTU_MC3_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613F6u)

/** \brief 3F8, Error Information Register 3 */
#define MTU_MC3_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613F8u)

/** \brief 3FA, Error Information Register 4 */
#define MTU_MC3_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00613FAu)

/** \brief 400, Configuration Registers */
#define MTU_MC4_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061400u)

/** \brief 402, Configuration Register 1 */
#define MTU_MC4_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061402u)

/** \brief 404, MBIST Control Register */
#define MTU_MC4_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061404u)

/** \brief 406, Status Register */
#define MTU_MC4_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061406u)

/** \brief 408, Range Register, single address mode */
#define MTU_MC4_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061408u)

/** \brief 40C, Revision ID Register */
#define MTU_MC4_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006140Cu)

/** \brief 40E, ECC Safety Register */
#define MTU_MC4_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006140Eu)

/** \brief 410, Memory ECC Detection Register */
#define MTU_MC4_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061410u)

/** \brief 412, Error Tracking Register 0 */
#define MTU_MC4_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061412u)

/** \brief 414, Error Tracking Register 1 */
#define MTU_MC4_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061414u)

/** \brief 416, Error Tracking Register 2 */
#define MTU_MC4_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061416u)

/** \brief 418, Error Tracking Register 3 */
#define MTU_MC4_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061418u)

/** \brief 41A, Error Tracking Register 4 */
#define MTU_MC4_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006141Au)

/** \brief 460, Read Data and Bit Flip Register 0 */
#define MTU_MC4_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061460u)

