Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxMtu_reg.h
/** \brief AF4, Error Information Register 1 */
#define MTU_MC10_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AF4u)

/** \brief AF6, Error Information Register 2 */
#define MTU_MC10_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AF6u)

/** \brief AF8, Error Information Register 3 */
#define MTU_MC10_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AF8u)

/** \brief AFA, Error Information Register 4 */
#define MTU_MC10_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AFAu)

/** \brief B00, Configuration Registers */
#define MTU_MC11_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061B00u)

/** \brief B02, Configuration Register 1 */
#define MTU_MC11_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061B02u)

/** \brief B04, MBIST Control Register */
#define MTU_MC11_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061B04u)

/** \brief B06, Status Register */
#define MTU_MC11_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061B06u)

/** \brief B08, Range Register, single address mode */
#define MTU_MC11_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061B08u)

/** \brief B0C, Revision ID Register */
#define MTU_MC11_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061B0Cu)

/** \brief B0E, ECC Safety Register */
#define MTU_MC11_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061B0Eu)

/** \brief B10, Memory ECC Detection Register */
#define MTU_MC11_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061B10u)

/** \brief B12, Error Tracking Register 0 */
#define MTU_MC11_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B12u)

/** \brief B14, Error Tracking Register 1 */
#define MTU_MC11_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B14u)

/** \brief B16, Error Tracking Register 2 */
#define MTU_MC11_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B16u)

/** \brief B18, Error Tracking Register 3 */
#define MTU_MC11_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B18u)

/** \brief B1A, Error Tracking Register 4 */
#define MTU_MC11_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061B1Au)

/** \brief B60, Read Data and Bit Flip Register 0 */
#define MTU_MC11_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B60u)

/** \brief B62, Read Data and Bit Flip Register 1 */
#define MTU_MC11_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B62u)

/** \brief B64, Read Data and Bit Flip Register 2 */
#define MTU_MC11_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B64u)

/** \brief B66, Read Data and Bit Flip Register 3 */
#define MTU_MC11_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B66u)

/** \brief B68, Read Data and Bit Flip Register 4 */
#define MTU_MC11_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B68u)

/** \brief B6A, Read Data and Bit Flip Register 5 */
#define MTU_MC11_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B6Au)

/** \brief B6C, Read Data and Bit Flip Register 6 */
#define MTU_MC11_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B6Cu)

/** \brief B6E, Read Data and Bit Flip Register 7 */
#define MTU_MC11_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B6Eu)

/** \brief B70, Read Data and Bit Flip Register 8 */
#define MTU_MC11_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B70u)

/** \brief B72, Read Data and Bit Flip Register 9 */
#define MTU_MC11_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B72u)

/** \brief B74, Read Data and Bit Flip Register 10 */
#define MTU_MC11_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B74u)

/** \brief B76, Read Data and Bit Flip Register 11 */
#define MTU_MC11_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B76u)

/** \brief B78, Read Data and Bit Flip Register 12 */
#define MTU_MC11_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B78u)

/** \brief B7A, Read Data and Bit Flip Register 13 */
#define MTU_MC11_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B7Au)

/** \brief B7C, Read Data and Bit Flip Register 14 */
#define MTU_MC11_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B7Cu)

/** \brief B7E, Read Data and Bit Flip Register 15 */
#define MTU_MC11_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B7Eu)

/** \brief B80, Read Data and Bit Flip Register 16 */
#define MTU_MC11_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B80u)

/** \brief B82, Read Data and Bit Flip Register 17 */
#define MTU_MC11_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B82u)

/** \brief B84, Read Data and Bit Flip Register 18 */
#define MTU_MC11_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B84u)

/** \brief B86, Read Data and Bit Flip Register 19 */
#define MTU_MC11_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B86u)

/** \brief B88, Read Data and Bit Flip Register 20 */
#define MTU_MC11_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B88u)

/** \brief B8A, Read Data and Bit Flip Register 21 */
#define MTU_MC11_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B8Au)

/** \brief B8C, Read Data and Bit Flip Register 22 */
#define MTU_MC11_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B8Cu)

/** \brief B8E, Read Data and Bit Flip Register 23 */
#define MTU_MC11_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B8Eu)

/** \brief B90, Read Data and Bit Flip Register 24 */
#define MTU_MC11_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B90u)

/** \brief B92, Read Data and Bit Flip Register 25 */
#define MTU_MC11_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B92u)

