Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxMtu_reg.h
/** \brief 17A0, Read Data and Bit Flip Register 32 */
#define MTU_MC23_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A0u)

/** \brief 17A2, Read Data and Bit Flip Register 33 */
#define MTU_MC23_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A2u)

/** \brief 17A4, Read Data and Bit Flip Register 34 */
#define MTU_MC23_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A4u)

/** \brief 17A6, Read Data and Bit Flip Register 35 */
#define MTU_MC23_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A6u)

/** \brief 17A8, Read Data and Bit Flip Register 36 */
#define MTU_MC23_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627A8u)

/** \brief 17AA, Read Data and Bit Flip Register 37 */
#define MTU_MC23_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627AAu)

/** \brief 17AC, Read Data and Bit Flip Register 38 */
#define MTU_MC23_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627ACu)

/** \brief 17AE, Read Data and Bit Flip Register 39 */
#define MTU_MC23_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627AEu)

/** \brief 17B0, Read Data and Bit Flip Register 40 */
#define MTU_MC23_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B0u)

/** \brief 17B2, Read Data and Bit Flip Register 41 */
#define MTU_MC23_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B2u)

/** \brief 17B4, Read Data and Bit Flip Register 42 */
#define MTU_MC23_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B4u)

/** \brief 17B6, Read Data and Bit Flip Register 43 */
#define MTU_MC23_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B6u)

/** \brief 17B8, Read Data and Bit Flip Register 44 */
#define MTU_MC23_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627B8u)

/** \brief 17BA, Read Data and Bit Flip Register 45 */
#define MTU_MC23_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627BAu)

/** \brief 17BC, Read Data and Bit Flip Register 46 */
#define MTU_MC23_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627BCu)

/** \brief 17BE, Read Data and Bit Flip Register 47 */
#define MTU_MC23_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627BEu)

/** \brief 17C0, Read Data and Bit Flip Register 48 */
#define MTU_MC23_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C0u)

/** \brief 17C2, Read Data and Bit Flip Register 49 */
#define MTU_MC23_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C2u)

/** \brief 17C4, Read Data and Bit Flip Register 50 */
#define MTU_MC23_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C4u)

/** \brief 17C6, Read Data and Bit Flip Register 51 */
#define MTU_MC23_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C6u)

/** \brief 17C8, Read Data and Bit Flip Register 52 */
#define MTU_MC23_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627C8u)

/** \brief 17CA, Read Data and Bit Flip Register 53 */
#define MTU_MC23_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627CAu)

/** \brief 17CC, Read Data and Bit Flip Register 54 */
#define MTU_MC23_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627CCu)

/** \brief 17CE, Read Data and Bit Flip Register 55 */
#define MTU_MC23_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627CEu)

/** \brief 17D0, Read Data and Bit Flip Register 56 */
#define MTU_MC23_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D0u)

/** \brief 17D2, Read Data and Bit Flip Register 57 */
#define MTU_MC23_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D2u)

/** \brief 17D4, Read Data and Bit Flip Register 58 */
#define MTU_MC23_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D4u)

/** \brief 17D6, Read Data and Bit Flip Register 59 */
#define MTU_MC23_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D6u)

/** \brief 17D8, Read Data and Bit Flip Register 60 */
#define MTU_MC23_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627D8u)

/** \brief 17DA, Read Data and Bit Flip Register 61 */
#define MTU_MC23_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627DAu)

/** \brief 17DC, Read Data and Bit Flip Register 62 */
#define MTU_MC23_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627DCu)

/** \brief 17DE, Read Data and Bit Flip Register 63 */
#define MTU_MC23_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627DEu)

/** \brief 17E0, Read Data and Bit Flip Register 64 */
#define MTU_MC23_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627E0u)

/** \brief 17E2, Read Data and Bit Flip Register 65 */
#define MTU_MC23_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627E2u)

/** \brief 17E4, Read Data and Bit Flip Register 66 */
#define MTU_MC23_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00627E4u)

/** \brief 17EE, Alarm Sources Configuration Register */
#define MTU_MC23_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00627EEu)

/** \brief 17F0, SSH Safety Faults Status Register  */
#define MTU_MC23_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00627F0u)

/** \brief 17F2, Error Information Register 0 */
#define MTU_MC23_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627F2u)

/** \brief 17F4, Error Information Register 1 */
#define MTU_MC23_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627F4u)

/** \brief 17F6, Error Information Register 2 */
#define MTU_MC23_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627F6u)

/** \brief 17F8, Error Information Register 3 */
#define MTU_MC23_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627F8u)

/** \brief 17FA, Error Information Register 4 */
#define MTU_MC23_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00627FAu)

/** \brief 1800, Configuration Registers */
#define MTU_MC24_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062800u)

