Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxMtu_reg.h
/** \brief 2C74, Read Data and Bit Flip Register 10 */
#define MTU_MC44_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C74u)

/** \brief 2C76, Read Data and Bit Flip Register 11 */
#define MTU_MC44_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C76u)

/** \brief 2C78, Read Data and Bit Flip Register 12 */
#define MTU_MC44_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C78u)

/** \brief 2C7A, Read Data and Bit Flip Register 13 */
#define MTU_MC44_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C7Au)

/** \brief 2C7C, Read Data and Bit Flip Register 14 */
#define MTU_MC44_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C7Cu)

/** \brief 2C7E, Read Data and Bit Flip Register 15 */
#define MTU_MC44_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C7Eu)

/** \brief 2C80, Read Data and Bit Flip Register 16 */
#define MTU_MC44_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C80u)

/** \brief 2C82, Read Data and Bit Flip Register 17 */
#define MTU_MC44_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C82u)

/** \brief 2C84, Read Data and Bit Flip Register 18 */
#define MTU_MC44_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C84u)

/** \brief 2C86, Read Data and Bit Flip Register 19 */
#define MTU_MC44_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C86u)

/** \brief 2C88, Read Data and Bit Flip Register 20 */
#define MTU_MC44_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C88u)

/** \brief 2C8A, Read Data and Bit Flip Register 21 */
#define MTU_MC44_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C8Au)

/** \brief 2C8C, Read Data and Bit Flip Register 22 */
#define MTU_MC44_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C8Cu)

/** \brief 2C8E, Read Data and Bit Flip Register 23 */
#define MTU_MC44_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C8Eu)

/** \brief 2C90, Read Data and Bit Flip Register 24 */
#define MTU_MC44_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C90u)

/** \brief 2C92, Read Data and Bit Flip Register 25 */
#define MTU_MC44_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C92u)

/** \brief 2C94, Read Data and Bit Flip Register 26 */
#define MTU_MC44_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C94u)

/** \brief 2C96, Read Data and Bit Flip Register 27 */
#define MTU_MC44_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C96u)

/** \brief 2C98, Read Data and Bit Flip Register 28 */
#define MTU_MC44_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C98u)

/** \brief 2C9A, Read Data and Bit Flip Register 29 */
#define MTU_MC44_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C9Au)

/** \brief 2C9C, Read Data and Bit Flip Register 30 */
#define MTU_MC44_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C9Cu)

/** \brief 2C9E, Read Data and Bit Flip Register 31 */
#define MTU_MC44_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063C9Eu)

/** \brief 2CA0, Read Data and Bit Flip Register 32 */
#define MTU_MC44_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA0u)

/** \brief 2CA2, Read Data and Bit Flip Register 33 */
#define MTU_MC44_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA2u)

/** \brief 2CA4, Read Data and Bit Flip Register 34 */
#define MTU_MC44_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA4u)

/** \brief 2CA6, Read Data and Bit Flip Register 35 */
#define MTU_MC44_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA6u)

/** \brief 2CA8, Read Data and Bit Flip Register 36 */
#define MTU_MC44_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CA8u)

/** \brief 2CAA, Read Data and Bit Flip Register 37 */
#define MTU_MC44_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CAAu)

/** \brief 2CAC, Read Data and Bit Flip Register 38 */
#define MTU_MC44_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CACu)

/** \brief 2CAE, Read Data and Bit Flip Register 39 */
#define MTU_MC44_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CAEu)

/** \brief 2CB0, Read Data and Bit Flip Register 40 */
#define MTU_MC44_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB0u)

/** \brief 2CB2, Read Data and Bit Flip Register 41 */
#define MTU_MC44_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB2u)

/** \brief 2CB4, Read Data and Bit Flip Register 42 */
#define MTU_MC44_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB4u)

/** \brief 2CB6, Read Data and Bit Flip Register 43 */
#define MTU_MC44_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB6u)

/** \brief 2CB8, Read Data and Bit Flip Register 44 */
#define MTU_MC44_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CB8u)

/** \brief 2CBA, Read Data and Bit Flip Register 45 */
#define MTU_MC44_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CBAu)

/** \brief 2CBC, Read Data and Bit Flip Register 46 */
#define MTU_MC44_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CBCu)

/** \brief 2CBE, Read Data and Bit Flip Register 47 */
#define MTU_MC44_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CBEu)

/** \brief 2CC0, Read Data and Bit Flip Register 48 */
#define MTU_MC44_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC0u)

/** \brief 2CC2, Read Data and Bit Flip Register 49 */
#define MTU_MC44_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC2u)

/** \brief 2CC4, Read Data and Bit Flip Register 50 */
#define MTU_MC44_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC4u)

/** \brief 2CC6, Read Data and Bit Flip Register 51 */
#define MTU_MC44_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC6u)

