Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxMtu_reg.h
/** \brief 34F2, Error Information Register 0 */
#define MTU_MC52_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644F2u)

/** \brief 34F4, Error Information Register 1 */
#define MTU_MC52_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644F4u)

/** \brief 34F6, Error Information Register 2 */
#define MTU_MC52_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644F6u)

/** \brief 34F8, Error Information Register 3 */
#define MTU_MC52_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644F8u)

/** \brief 34FA, Error Information Register 4 */
#define MTU_MC52_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00644FAu)

/** \brief 3500, Configuration Registers */
#define MTU_MC53_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064500u)

/** \brief 3502, Configuration Register 1 */
#define MTU_MC53_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064502u)

/** \brief 3504, MBIST Control Register */
#define MTU_MC53_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064504u)

/** \brief 3506, Status Register */
#define MTU_MC53_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064506u)

/** \brief 3508, Range Register, single address mode */
#define MTU_MC53_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064508u)

/** \brief 350C, Revision ID Register */
#define MTU_MC53_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006450Cu)

/** \brief 350E, ECC Safety Register */
#define MTU_MC53_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006450Eu)

/** \brief 3510, Memory ECC Detection Register */
#define MTU_MC53_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064510u)

/** \brief 3512, Error Tracking Register 0 */
#define MTU_MC53_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064512u)

/** \brief 3514, Error Tracking Register 1 */
#define MTU_MC53_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064514u)

/** \brief 3516, Error Tracking Register 2 */
#define MTU_MC53_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064516u)

/** \brief 3518, Error Tracking Register 3 */
#define MTU_MC53_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064518u)

/** \brief 351A, Error Tracking Register 4 */
#define MTU_MC53_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006451Au)

/** \brief 3560, Read Data and Bit Flip Register 0 */
#define MTU_MC53_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064560u)

/** \brief 3562, Read Data and Bit Flip Register 1 */
#define MTU_MC53_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064562u)

/** \brief 3564, Read Data and Bit Flip Register 2 */
#define MTU_MC53_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064564u)

/** \brief 3566, Read Data and Bit Flip Register 3 */
#define MTU_MC53_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064566u)

/** \brief 3568, Read Data and Bit Flip Register 4 */
#define MTU_MC53_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064568u)

/** \brief 356A, Read Data and Bit Flip Register 5 */
#define MTU_MC53_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006456Au)

/** \brief 356C, Read Data and Bit Flip Register 6 */
#define MTU_MC53_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006456Cu)

/** \brief 356E, Read Data and Bit Flip Register 7 */
#define MTU_MC53_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006456Eu)

/** \brief 3570, Read Data and Bit Flip Register 8 */
#define MTU_MC53_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064570u)

/** \brief 3572, Read Data and Bit Flip Register 9 */
#define MTU_MC53_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064572u)

/** \brief 3574, Read Data and Bit Flip Register 10 */
#define MTU_MC53_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064574u)

/** \brief 3576, Read Data and Bit Flip Register 11 */
#define MTU_MC53_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064576u)

/** \brief 3578, Read Data and Bit Flip Register 12 */
#define MTU_MC53_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064578u)

/** \brief 357A, Read Data and Bit Flip Register 13 */
#define MTU_MC53_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006457Au)

/** \brief 357C, Read Data and Bit Flip Register 14 */
#define MTU_MC53_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006457Cu)

/** \brief 357E, Read Data and Bit Flip Register 15 */
#define MTU_MC53_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006457Eu)

/** \brief 3580, Read Data and Bit Flip Register 16 */
#define MTU_MC53_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064580u)

/** \brief 3582, Read Data and Bit Flip Register 17 */
#define MTU_MC53_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064582u)

/** \brief 3584, Read Data and Bit Flip Register 18 */
#define MTU_MC53_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064584u)

/** \brief 3586, Read Data and Bit Flip Register 19 */
#define MTU_MC53_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064586u)

/** \brief 3588, Read Data and Bit Flip Register 20 */
#define MTU_MC53_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064588u)

/** \brief 358A, Read Data and Bit Flip Register 21 */
#define MTU_MC53_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006458Au)

/** \brief 358C, Read Data and Bit Flip Register 22 */
#define MTU_MC53_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006458Cu)

/** \brief 358E, Read Data and Bit Flip Register 23 */
#define MTU_MC53_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006458Eu)

/** \brief 3590, Read Data and Bit Flip Register 24 */
#define MTU_MC53_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064590u)

