Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxMtu_reg.h
/** \brief 4F04, MBIST Control Register */
#define MTU_MC79_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065F04u)

/** \brief 4F06, Status Register */
#define MTU_MC79_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065F06u)

/** \brief 4F08, Range Register, single address mode */
#define MTU_MC79_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065F08u)

/** \brief 4F0C, Revision ID Register */
#define MTU_MC79_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0065F0Cu)

/** \brief 4F0E, ECC Safety Register */
#define MTU_MC79_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065F0Eu)

/** \brief 4F10, Memory ECC Detection Register */
#define MTU_MC79_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065F10u)

/** \brief 4F12, Error Tracking Register 0 */
#define MTU_MC79_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F12u)

/** \brief 4F14, Error Tracking Register 1 */
#define MTU_MC79_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F14u)

/** \brief 4F16, Error Tracking Register 2 */
#define MTU_MC79_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F16u)

/** \brief 4F18, Error Tracking Register 3 */
#define MTU_MC79_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F18u)

/** \brief 4F1A, Error Tracking Register 4 */
#define MTU_MC79_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065F1Au)

/** \brief 4F60, Read Data and Bit Flip Register 0 */
#define MTU_MC79_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F60u)

/** \brief 4F62, Read Data and Bit Flip Register 1 */
#define MTU_MC79_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F62u)

/** \brief 4F64, Read Data and Bit Flip Register 2 */
#define MTU_MC79_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F64u)

/** \brief 4F66, Read Data and Bit Flip Register 3 */
#define MTU_MC79_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F66u)

/** \brief 4F68, Read Data and Bit Flip Register 4 */
#define MTU_MC79_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F68u)

/** \brief 4F6A, Read Data and Bit Flip Register 5 */
#define MTU_MC79_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F6Au)

/** \brief 4F6C, Read Data and Bit Flip Register 6 */
#define MTU_MC79_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F6Cu)

/** \brief 4F6E, Read Data and Bit Flip Register 7 */
#define MTU_MC79_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F6Eu)

/** \brief 4F70, Read Data and Bit Flip Register 8 */
#define MTU_MC79_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F70u)

/** \brief 4F72, Read Data and Bit Flip Register 9 */
#define MTU_MC79_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F72u)

/** \brief 4F74, Read Data and Bit Flip Register 10 */
#define MTU_MC79_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F74u)

/** \brief 4F76, Read Data and Bit Flip Register 11 */
#define MTU_MC79_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F76u)

/** \brief 4F78, Read Data and Bit Flip Register 12 */
#define MTU_MC79_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F78u)

/** \brief 4F7A, Read Data and Bit Flip Register 13 */
#define MTU_MC79_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F7Au)

/** \brief 4F7C, Read Data and Bit Flip Register 14 */
#define MTU_MC79_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F7Cu)

/** \brief 4F7E, Read Data and Bit Flip Register 15 */
#define MTU_MC79_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F7Eu)

/** \brief 4F80, Read Data and Bit Flip Register 16 */
#define MTU_MC79_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F80u)

/** \brief 4F82, Read Data and Bit Flip Register 17 */
#define MTU_MC79_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F82u)

/** \brief 4F84, Read Data and Bit Flip Register 18 */
#define MTU_MC79_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F84u)

/** \brief 4F86, Read Data and Bit Flip Register 19 */
#define MTU_MC79_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F86u)

/** \brief 4F88, Read Data and Bit Flip Register 20 */
#define MTU_MC79_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F88u)

/** \brief 4F8A, Read Data and Bit Flip Register 21 */
#define MTU_MC79_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F8Au)

/** \brief 4F8C, Read Data and Bit Flip Register 22 */
#define MTU_MC79_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F8Cu)

/** \brief 4F8E, Read Data and Bit Flip Register 23 */
#define MTU_MC79_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F8Eu)

/** \brief 4F90, Read Data and Bit Flip Register 24 */
#define MTU_MC79_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F90u)

/** \brief 4F92, Read Data and Bit Flip Register 25 */
#define MTU_MC79_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F92u)

/** \brief 4F94, Read Data and Bit Flip Register 26 */
#define MTU_MC79_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F94u)

/** \brief 4F96, Read Data and Bit Flip Register 27 */
#define MTU_MC79_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F96u)

/** \brief 4F98, Read Data and Bit Flip Register 28 */
#define MTU_MC79_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F98u)

/** \brief 4F9A, Read Data and Bit Flip Register 29 */
#define MTU_MC79_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F9Au)

/** \brief 4F9C, Read Data and Bit Flip Register 30 */
#define MTU_MC79_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F9Cu)

